Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 128, 128, 2)       20        
                                                                 
 max_pooling2d (MaxPooling2  (None, 64, 64, 2)         0         
 D)                                                              
                                                                 
 conv2d_1 (Conv2D)           (None, 64, 64, 4)         76        
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 32, 32, 4)         0         
 g2D)                                                            
                                                                 
 conv2d_2 (Conv2D)           (None, 32, 32, 8)         296       
                                                                 
 max_pooling2d_2 (MaxPoolin  (None, 16, 16, 8)         0         
 g2D)                                                            
                                                                 
 dropout (Dropout)           (None, 16, 16, 8)         0         
                                                                 
 conv2d_3 (Conv2D)           (None, 16, 16, 16)        1168      
                                                                 
 max_pooling2d_3 (MaxPoolin  (None, 8, 8, 16)          0         
 g2D)                                                            
                                                                 
 dropout_1 (Dropout)         (None, 8, 8, 16)          0         
                                                                 
 conv2d_4 (Conv2D)           (None, 8, 8, 32)          4640      
                                                                 
 dropout_2 (Dropout)         (None, 8, 8, 32)          0         
                                                                 
 flatten (Flatten)           (None, 2048)              0         
                                                                 
 dense (Dense)               (None, 1)                 2049      
                                                                 
=================================================================
Total params: 8249 (32.22 KB)
Trainable params: 8249 (32.22 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________